In [1]:
import pandas as pd

In [2]:
import pyodbc 
cnxn = pyodbc.connect("Driver={SQL Server Native Client 11.0};"
                      "Server=LAPTOP-D0942MUC\SQLEXPRESS;"
                      "Database=college;"
                      "Trusted_Connection=yes;")

In [3]:
Students=pd.read_sql("SELECT * FROM Students$",cnxn)

In [4]:
Students.head()

   StudentId FirstName   LastName Gender
0      162.0    Elmira    Holston      F
1      154.0    Sierra  Van Vorst      F
2       28.0     Mycah    Bingham      F
3       54.0      Alia      Jones      F
4       31.0    Chanda   Fillmore      F

In [5]:
Courses = pd.read_sql("SELECT * FROM Courses$",cnxn)

In [6]:
Courses.head()

   CourseId            CourseName  DepartmentID  TeacherId
0       1.0     English Begginers           1.0       15.0
1       2.0      Advanced English           1.0       15.0
2       3.0  Proffesional English           1.0       15.0
3       4.0       Mathematics 101           2.0        2.0
4       5.0   Matematics Advanced           2.0       13.0

In [7]:
Classrooms = pd.read_sql("SELECT * FROM Classrooms$",cnxn)

In [8]:
Classrooms.head()

   CourseId  StudentId     degree
0       1.0      202.0  92.031070
1       1.0       12.0  81.175916
2       1.0      232.0  82.396587
3       1.0      123.0  62.420449
4       1.0      274.0  72.569900

In [9]:
Departments = pd.read_sql("SELECT * FROM Departments$",cnxn)

In [10]:
Departments.head()

   DepartmentId DepartmentName
0           1.0        English
1           2.0        Science
2           3.0           Arts
3           4.0          Sport

In [11]:
len(Departments)

4

In [12]:
Teachers = pd.read_sql("SELECT * FROM Teachers$",cnxn)

In [13]:
Teachers.head()

   TeacherId   FirstName  LastName Gender
0        1.0      Kaylea  Monzingo      F
1        2.0      Amanda   Dworkin      F
2        3.0      Jordyn     Baron      F
3        4.0   Katherine    Dibari      F
4        5.0     Heather   Metcalf      F

In [14]:
class_students = pd.merge(Classrooms,Students,how='inner',on='StudentId')

In [15]:
class_students.head()

   CourseId  StudentId     degree FirstName LastName Gender
0       1.0      202.0  92.031070    Autumn    Major      F
1       4.0      202.0  73.387328    Autumn    Major      F
2       8.0      202.0  83.563932    Autumn    Major      F
3      18.0      202.0  66.109849    Autumn    Major      F
4      20.0      202.0  63.988269    Autumn    Major      F

In [16]:
class_courses = pd.merge(Classrooms,Courses,how='left',on='CourseId')

In [17]:
len(class_courses)

754

In [18]:
teacher_courses = pd.merge(Teachers,Courses,how='inner',on='TeacherId')

In [19]:
teacher_courses.head()

,TeacherId,FirstName,LastName,Gender,CourseId,CourseName,DepartmentID
0,1.0,Kaylea,Monzingo,F,14.0,Computer Science,2.0
1,2.0,Amanda,Dworkin,F,4.0,Mathematics 101,2.0
2,3.0,Jordyn,Baron,F,10.0,Biology,2.0
3,4.0,Katherine,Dibari,F,26.0,Basketball,4.0
4,5.0,Heather,Metcalf,F,13.0,Statistics,2.0

In [20]:
len(teacher_courses)

31

In [ ]:
class_students_Department = pd.merge(how='',on=CourseId)